Tekla Open API Reference for Tekla Structures 2025
CylindricalSurface.Radius Property
 Gets radius of the cylindrical surface.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public double Radius { get; }
Public ReadOnly Property Radius As Double
	Get
Property Value
Type: Double
See Also
Reference
CylindricalSurface Class
Tekla.Structures.Model Namespace